; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 12242)
	(= (fuel plane1) 2567)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city2)
	(= (capacity plane2) 4866)
	(= (fuel plane2) 1588)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 5)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city2)
	(= (capacity plane3) 6384)
	(= (fuel plane3) 1317)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city1)
	(= (capacity plane4) 5047)
	(= (fuel plane4) 1202)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city2)
	(= (capacity plane5) 8648)
	(= (fuel plane5) 1844)
	(= (slow-burn plane5) 4)
	(= (fast-burn plane5) 13)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city1)
	(at person2 city1)
	(at person3 city0)
	(at person4 city1)
	(at person5 city2)
	(at person6 city2)
	(at person7 city1)
	(at person8 city0)
	(at person9 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 567)
	(= (distance city0 city2) 762)
	(= (distance city1 city0) 567)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 805)
	(= (distance city2 city0) 762)
	(= (distance city2 city1) 805)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane2 city1)
	(at plane4 city1)
	(at plane5 city2)
	(at person1 city1)
	(at person2 city1)
	(at person4 city1)
	(at person5 city0)
	(at person6 city2)
	(at person7 city2)
	(at person8 city1)
	(at person9 city2)
	))

(:metric minimize (+ (* 4 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 7 of 12
2. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 12
3. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 2268, (fuel plane1) from 2567 to 299
   goals met: 8 of 12
4. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 12
5. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 2268 to 3792, (fuel plane2) from 1588 to 64
   goals met: 9 of 12
6. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 12
7. (refuel plane2 city0)
   changed: (fuel plane2) from 64 to 4866
   goals met: 10 of 12
8. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 3792 to 4926, (fuel plane2) from 4866 to 3732
   goals met: 11 of 12
9. (board person7 plane2 city1)
   deleted: (at person7 city1)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 11 of 12
10. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 4926 to 6536, (fuel plane2) from 3732 to 2122
   goals met: 10 of 12
11. (debark person7 plane2 city2)
   deleted: (in person7 plane2)
   added: (at person7 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 11 of 12
12. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 6536 to 8146, (fuel plane2) from 2122 to 512
   goals met: 12 of 12
